APC10x4.7/6000RPM/10mps6000rpm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//
// 3, 7                                 2, 6
// +-------------------------------------+
// |                                     |
// |                                     |
// |                                     |
// |                                     |
// |inlet                                |outlet
// |                                     |
// |                                     |
// |           |                         |
// |           | rotor                   |
// +-----------|-------------------------+
// 0, 4                                 1, 5
//

scale   1;

xmin   -1; //-0.75
xmax    10;
ymin    0;
ymax    1;
zmin   -1;
zmax    0;


vertices
(
    ($xmin  $ymin $zmin) // 0
    ($xmax  $ymin $zmin) // 1
    ($xmax  $ymax $zmin) // 2
    ($xmin  $ymax $zmin) // 3

    ($xmin  $ymin $zmax) // 4
    ($xmax  $ymin $zmax) // 5
    ($xmax  $ymax $zmax) // 6
    ($xmin  $ymax $zmax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 30 30) simpleGrading (3 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces  ((0 3 7 4));
    }

    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }

    walls
    {
        type patch;
        faces (
            (0 1 2 3)
            (2 6 7 3)   
        );
    }

    symY
    {
        type cyclic;
        faces ((0 4 5 1));
        neighbourPatch symZ;
    }

    symZ
    {
        type cyclic;
        faces ((4 7 6 5));
        neighbourPatch symY;
    }

   /*  symY
    {
        type symmetryPlane;
        faces ((0 4 5 1));
    }

    symZ
    {
        type symmetryPlane;
        faces ((4 7 6 5));
    } */
);

// ************************************************************************* //
